In [1]:
import pandas as pd

## How to handle missing values in pandas?

**What does "NaN" mean?**

- **"NaN"** is not a string, rather it's a special value: **`numpy.nan`**.
- It stands for **"Not a Number"** and indicates a missing value.
- **read_csv** detects missing values (by default) when reading the file, and replaces them with this special value.

In [2]:
# read a dataset of UFO reports into a DataFrame

ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [3]:
# 'isnull' returns a DataFrame of booleans (True if missing, False if not missing)

ufo.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [4]:
# 'nonnull' returns the opposite of 'isnull' (True if not missing, False if missing)

ufo.notnull().tail()

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [5]:
# count the number of missing values in each Series

ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

This calculation works because:

- The **`sum`** method for a DataFrame operates on **`axis=0`** by default (and thus produces column sums).
- In order to add boolean values, pandas converts **`True`** to **1** and **`False`** to **0**.

In [6]:
# use the 'isnull' Series method to filter the DataFrame rows

ufo[ufo.City.isnull()].head()

    City Colors Reported Shape Reported State             Time
21   NaN             NaN            NaN    LA   8/15/1943 0:00
22   NaN             NaN          LIGHT    LA   8/15/1943 0:00
204  NaN             NaN           DISK    CA  7/15/1952 12:30
241  NaN            BLUE           DISK    MT   7/4/1953 14:00
613  NaN             NaN           DISK    NV   7/1/1960 12:00

##### How to handle missing values depends on the dataset as well as the nature of your analysis. Here are some options:

In [7]:
# examine the number of rows and columns

ufo.shape

(18241, 5)

In [8]:
# if 'any' values are missing in a row, then drop that row
# how='any' means drop all ther rows where any of the column's value is missing.

ufo.dropna(how='any').shape

(2486, 5)

In [9]:
# 'inplace' parameter for 'dropna' is False by default, thus rows were only dropped temporarily
# so to make the changes permanent we need to pass the 'inplace=True' parameter

ufo.shape

(18241, 5)

In [10]:
# if 'all' values are missing in a row, then drop that row (none are dropped in this case)
# how='all' means drop a row only when all the column's value of that row are missing.

ufo.dropna(how='all').shape

(18241, 5)

In [11]:
# if 'any' values are missing in a row (considering only 'City' and 'Shape Reported'), then drop that row
# the 'subset' option will make the drop when any of the columns passed in it have a missing value for any row
# it is like 'or' condition

ufo.dropna(subset=['City', 'Shape Reported'], how='any').shape

(15576, 5)

In [12]:
# if 'all' values are missing in a row (considering only 'City' and 'Shape Reported'), then drop that row
# Here only drop a row when both the column will have a missing value for that row
# it is like 'and' condition

ufo.dropna(subset=['City', 'Shape Reported'], how='all').shape

(18237, 5)

In [13]:
# 'value_counts' does not include missing values by default

ufo['Shape Reported'].value_counts().head()

LIGHT       2803
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
Name: Shape Reported, dtype: int64

In [14]:
# explicitly include missing values

ufo['Shape Reported'].value_counts(dropna=False).head()

LIGHT       2803
NaN         2644
DISK        2122
TRIANGLE    1889
OTHER       1402
Name: Shape Reported, dtype: int64

In [15]:
# fill in missing values with a specified value

ufo['Shape Reported'].fillna(value='VARIOUS', inplace=True)

In [17]:
# confirm that the missing values were filled in

ufo['Shape Reported'].value_counts()

VARIOUS      2977
LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
DOME            1
PYRAMID         1
FLARE           1
HEXAGON         1
Name: Shape Reported, dtype: int64